opencds-parent/opencds-decision-support-service/opencds-knowledge-repository-data/resources_v1.1/samples/OpenCdsDrugConditionInteractionScreeningRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:dss="http://www.omg.org/spec/CDSS/201012/dss">
	<SOAP-ENV:Header/>
	<SOAP-ENV:Body>
		<dss:evaluateAtSpecifiedTime>
			<interactionId scopingEntityId="com.hp" interactionId="123456" submissionTime="2011-08-03T00:00:00.000"/>
			<specifiedTime>2011-08-03</specifiedTime>
			<evaluationRequest>
				<kmEvaluationRequest>
					<kmId scopingEntityId="org.AFHIL" businessId="ScreenDrugConditionInteraction" version="1.0.0"/>
				</kmEvaluationRequest>
				<dataRequirementItemData>
					<driId itemId="PrimaryDataRequirementItem">
						<containingEntityId scopingEntityId="org.AFHIL" businessId="ScreenDrugConditionInteraction" version="1.0.0"/>
					</driId>
					<data>
						<informationModelSSId scopingEntityId="org.opencds.vmr" businessId="cdsInput" version="alpha"/>
						<base64EncodedPayload>[Base64-encoded payload]</base64EncodedPayload>
					</data>
				</dataRequirementItemData>
			</evaluationRequest>
		</dss:evaluateAtSpecifiedTime>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
